#+TITLE:CS 237 Syllabus and Portfolio@@html:<br>@@ Winter 2019
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty

** DONE UIN
   CLOSED: [2019-01-17 Thu 16:13]
#+begin_note
  What is the set difference between the set of letters in the English alphabet
  and the set of letters in the Hawaiian alphabet?
#+end_note
#+BEGIN_SRC emacs-lisp
;;I will use sets to see the difference.  I googled the Hawaiian alphabet.
(require 'cl)
(set-difference '(a b c d e f g h i j k l m n o p q r s t u v w x y z) '(a e i o u h k l m n p w))
#+END_SRC

#+RESULTS:
| b | c | d | f | g | j | q | r | s | t | v | x | y | z |

** DONE TEJ
   CLOSED: [2019-01-24 Thu 13:24]
#+begin_note
  A function-as-association between elements of a domain and elements of a
  codomain, for \ldquo{}small\rdquo domains and codomains, inspired so-called \ldquo{}association
  lists\rdquo (or alists) and the =assoc= (and associated) functions.

  =(assoc KEY LIST)= returns non-nil if KEY is \ldquo{}equal\rdquo to the first element of
  an element of LIST. The value is actually the first element of LIST whose
  first element equals KEY.

  For example, here is a function that uses an alist to look up the RGB values
  of a given color name:

#+BEGIN_SRC emacs-lisp :results silent
  (defun lookup-rgb (color-name)
    (rest (assoc color-name
                 '(("red" 255 0 0) ("green" 0 255 0) ("blue" 0 0 255)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results raw
  (lookup-rgb "blue")
#+END_SRC

: (0 0 255)

  What if the color name is not in the alist?

#+BEGIN_SRC emacs-lisp :results raw
  (lookup-rgb "grue")
#+END_SRC

: nil

  There are several variations of =assoc=. Find and give examples of using them.
#+end_note
#+BEGIN_SRC emacs-lisp
  (defun lookup-rgb (color-name)
    (rest (assoc-string color-name
                 '(("red" 255 0 0) ("green" 0 255 0) ("blue" 0 0 255)))))
  (lookup-rgb "blue")
#+END_SRC

#+RESULTS:
| 0 | 0 | 255 |
For assoc-string, the key should be a string.

#+BEGIN_SRC emacs-lisp
  (defun lookup-rgb (color-name)
    (rest (rassoc color-name
                 '(("red" 255 0 0) ("green" 0 255 0) ("blue" 0 0 255)))))
  (lookup-rgb '(255 0 0))
#+END_SRC

#+RESULTS:
| 255 | 0 | 0 |
For rassoc, you use the results to look up the item. It's like a reverse assoc

#+BEGIN_SRC emacs-lisp
  (defun lookup-rgb (color-name)
    (rest (assq color-name
                 '((red 255 0 0) (green 0 255 0) (blue 0 0 255)))))
  (lookup-rgb 'blue)
#+END_SRC

#+RESULTS:
| 0 | 0 | 255 |
Very simmilar to assoc. You don't need quotes arond the names and just a quote on what you are looking up.
#+END_SRC

** DONE WFC
   CLOSED: [2019-01-24 Thu 16:29]
#+begin_note
  Remembering that these are functions, do the four basic math operators (=+=,
  =-=, =*=, =/=) work as you might expect?

  How about when the number of operands
  - is greater than two?
  - is less than two (i.e., one or zero)?

  This is a good time to mention that functions with arity /n/ for /n/ = 1
  (unary) and /n/ = 2 (binary) have alternate type names, as does a generic
  classification for /n/ > 2:

  | Arity | Type     |
  |-------+----------|
  |     1 | Monadic  |
  |     2 | Dyadic   |
  |   > 2 | Polyadic |

  Argue for /polyadic/ to mean having /arbitrary arity/ (taking 0 /or more/
  arguments).
#+end_note
#+begin_info
  I am familliar with prefix equations, so it works as expected.  If you use multiple operands,
  you have to use parenthesis
#+end_info
#+BEGIN_SRC elisp
  (+ 3(* 2 3))
#+END_SRC

#+RESULTS:
: 9

** DONE TNQ
   CLOSED: [2019-01-25 Fri 15:45]
#+begin_note
  Consider the following function:

#+BEGIN_SRC emacs-lisp
  (defun calculate-pi-very-slowly (max-iterations)
    (* 4 (loop for n from 0 to max-iterations
               sum (/ 1.0 (* (+ (* 2 n) 1) (expt -1 n))))))

(calculate-pi-very-slowly 10000)
#+END_SRC

#+RESULTS:
: 3.1416926435905346

  How slow is \ldquo{}very slowly\rdquo?
#+end_note
#+begin_info
  The more loops the program goes through, the more precise pi becomes.  That means that if you
  want the most precision, you must run the loop that many times.  For infinite precision,
  you would have to loop through infinite times, taking infinite time!  Super slow!
#+end_info

** DONE ECI
   CLOSED: [2019-01-29 Tue 16:31]
#+begin_note
  Implement the =for-some-for-some=, =for-some-for-all=, and =for-all-for-some=
  functions in a similar manner to the mapping =for-all-for-all=. Test them with
  at least three different predicates and their associated domains.
:HINT:
  - Hint :: See MGX for the context. If there is an =every= for universal
            quantification, what might be its existential counterpart function?
:END:
#+end_note
#+begin_info
  Your answer goes here.

#+BEGIN_SRC elisp :results silent
  (defun map-for-some (pred x domain-y)
    (some (lambda (y) (funcall pred x y)) domain-y))
#+END_SRC

#+BEGIN_SRC elisp :results silent
  (defun map-for-all-for-some (pred domain-x domain-y)
    (every (lambda (x) (map-for-some pred x domain-y)) domain-x))
#+END_SRC

#+BEGIN_SRC elisp :results silent
  (defun map-for-some-for-all (pred domain-x domain-y)
    (some (lambda (x) (map-for-all pred x domain-y)) domain-x))
#+END_SRC

#+BEGIN_SRC elisp :results silent
  (defun map-for-some-for-some (pred domain-x domain-y)
    (some (lambda (x) (map-for-some pred x domain-y)) domain-x))
#+END_SRC
#+end_info
#+BEGIN_SRC elisp
  (list 

  (map-for-all-for-some '< [1 2 5] [1 5 5])
 
  (map-for-some-for-all '< [1 6 3] [4 5 6])

  (map-for-some-for-some '< [1 8 3] [4 1 6]))

#+END_SRC

#+RESULTS:
| nil | t | t |

** RGM
#+begin_note
  How many TLAs (arrangements of 3 alphabetic letters) are there /with
  repetition allowed/?
#+end_note
#+begin_info
  This would be equal to the entire alphbet raisted to the power of 3 for three letter
#+end_info
#+BEGIN_SRC elisp
  (expt 26 3)
#+END_SRC

#+RESULTS:
: 17576

** QFK
#+begin_note
  How many different sequences of initials are there for people who either have
  two initials (first and last) or three initials (first, middle and last)?
#+end_note
#+begin_info
  simmilar to above.
#+end_info
#+BEGIN_SRC elisp
  (+ (expt 26 3) (expt 26 2))
#+END_SRC

#+RESULTS:
: 18252

** RHB
#+begin_note
  How many different sequences can be formed using /either/ two /or/ three
  letters (A-Z) followed by /either/ two /or/ three digits (0-9)?

  For example:

  - AB01
  - ABC02
  - XYZ123
  - ...
#+end_note
#+begin_info
#+end_info
#+BEGIN_SRC elisp
  (+ (+ (expt 26 2) (expt 10 2) (expt 10 3)) (+ (expt 26 3) (expt 10 2) (expt 10 3)))
#+END_SRC

#+RESULTS:
: 20452

** QGK
#+begin_note
  How many different \ldquo{}words\rdquo of the form =ccvcv= are there where =c= represents
  one of the 21 consonants and =v= represents one of the 5 vowels in the English
  alphabet? Assume no letter can be repeated, just count words like \ldquo{}tribe\rdquo or
  \ldquo{}blizo\rdquo --- a non-word but count it anyway --- but not something like \ldquo{}trite\rdquo
  or \ldquo{}gligi\rdquo, which have repeated letters.
#+end_note
#+begin_info
Non-repeating consonants is 20 * 19, times 6 vowels, 18 more consonants (so as to not repeat), then 6 vowels again.
#+end_info
#+BEGIN_SRC elisp
  (* (* 20 19) 18 (expt 5 2))

#+END_SRC

#+RESULTS:
: 171000

** RNM
#+begin_note
  Rather than roll dice, Ruth and Ed usually flip a coin to decide who's going
  to do the chores. One day Ed complains --- he thinks he loses too often. So
  Ruth says, \ldquo{}OK, this time you flip two coins, and I flip one. If you get more
  heads than I do, I\rsquo{}ll clean the toilets.\rdquo Ed likes Ruth\rsquo{}s display of
  generosity and says, \ldquo{}You\rsquo{}re on!\rdquo

  What are his chances?
:HINT:
  - Hint :: This was adapted from a problem posed by Marilyn Vos Savant in her
            \ldquo{}Ask Marilyn\rdquo Parade Magazine column.
:END:
#+end_note
#+begin_info
  His chances are exactly the same.  Because there is a 1/2 chance of getting heads, you add the 
  probability and divide it by the number of coins he is playing with.
#+end_info
#+BEGIN_SRC elisp
  (/ (+ 0.5 0.5) 2)
#+END_SRC

#+RESULTS:
: 0.5

** DONE FDZ
   CLOSED: [2019-02-14 Thu 15:39]
#+begin_note
  Re-implement =prime-power-list-to-number= without using =let= by instead
  putting everything =let= is doing within the =loop=.
:HINT:
  - Hint :: Use the =with= and =finally return= keywords.
:END:
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
#+BEGIN_SRC elisp :reults raw
 (defun prime-power-list-to-number (prime-power-list)
  (reduce #'* (loop with number = 1
        with primes = [2 3 5 7 11 13 17 19 23 29 31 37 41 43 47 53 59 61 67 71]
        for prime across primes
        for power in prime-power-list
        collect (* number (expt prime power)))))
#+END_SRC

#+RESULTS:
: prime-power-list-to-number
#+BEGIN_SRC elisp
  (prime-power-list-to-number '(6 5 4 3 2 1))
#+END_SRC

#+RESULTS:
: 5244319080000

** DONE FJH
   CLOSED: [2019-02-14 Thu 15:43]
#+begin_note
  The FTA supports the mapping of the sequence =[2 0 0 0 0 1]= to a two-digit
  number. What is that number?
#+end_note
#+begin_info
  Just using mental math, this is (13*2) * 2 = 52
#+end_info
#+BEGIN_SRC elisp
   (prime-power-list-to-number '(2 0 0 0 0 1))
#+END_SRC

#+RESULTS:
: 52

** DONE IWK
   CLOSED: [2019-02-14 Thu 15:54]
#+begin_note
  A famous theorem states that there are infinitely many primes of the form
  /ak/ + /b/ whenever /a/ and /b/ are coprime. To get a feel for this, find for
  /a/ = 4 and /b/ = 11, ten different values for /k/ where /4k + 11/ is prime,
  and ten values where /4k + 11/ is nonprime.
#+end_note
#+begin_info
  Prime: 11, 15, 19, 23, 31, 39, 43, 59, 67, 71, 79
  Non-Prime: 27, 35, 47, 51, 55, 63, 75, 87, 91, 99
#+end_info
#+BEGIN_SRC elisp :reults list
  (loop for k upto 100
  collect (+ (* 4 k) 11))
#+END_SRC

#+RESULTS:
| 11 | 15 | 19 | 23 | 27 | 31 | 35 | 39 | 43 | 47 | 51 | 55 | 59 | 63 | 67 | 71 | 75 | 79 | 83 | 87 | 91 | 95 | 99 | 103 | 107 | 111 | 115 | 119 | 123 | 127 | 131 | 135 | 139 | 143 | 147 | 151 | 155 | 159 | 163 | 167 | 171 | 175 | 179 | 183 | 187 | 191 | 195 | 199 | 203 | 207 | 211 | 215 | 219 | 223 | 227 | 231 | 235 | 239 | 243 | 247 | 251 | 255 | 259 | 263 | 267 | 271 | 275 | 279 | 283 | 287 | 291 | 295 | 299 | 303 | 307 | 311 | 315 | 319 | 323 | 327 | 331 | 335 | 339 | 343 | 347 | 351 | 355 | 359 | 363 | 367 | 371 | 375 | 379 | 383 | 387 | 391 | 395 | 399 | 403 | 407 | 411 |

** DONE GMQ
   CLOSED: [2019-02-21 Thu 15:49]
#+begin_note
  First recall (or look up) how the =&rest= keyword works, e.g.:

#+BEGIN_SRC elisp :results silent
  (defun printf (format-directive &rest args)
    (princ (apply 'format format-directive args)))
#+END_SRC

  Now explain what this code does after trying it on a few tests:

#+BEGIN_SRC elisp :results silent
  (defun mystery (&rest numbers)
    (loop for n from 0 to (apply '* numbers)
          do (printf "%3d <--> %s\n" n
                     (loop for m in numbers collect (mod n m)))))
#+END_SRC

#+BEGIN_SRC elisp :results output
  (mystery 3 5)
#+END_SRC

#+BEGIN_SRC elisp :results output
  (mystery 4 6)
#+END_SRC

  Replace ='*= with ='lcm= and do the same calls again. Explain what you
  observed, and come up with a better name for the =mystery= function.
:HINT:
  - Hint :: In your source code blocks, use the header directive =:results
            output= for best results, e.g.:
: #+BEGIN_SRC elisp :results output
  - Peek Ahead Hint :: PQU
:END:
#+end_note
#+begin_info
  This creates a list of all numbers from zero to the least common multiple of the two numbers 
  you input.  In short, it displays all the possible mods of the two numbers, then stops when 
  both have an output of zero.
#+end_info
#+BEGIN_SRC emacs-lisp :results silent
 (defun printf (format-directive &rest args)
 (princ (apply 'format format-directive args)))
#+END_SRC
#+BEGIN_SRC emacs-lisp :results output
(printf "%s" '"hello there" '"my name is bryan" '"these are rest args")
#+END_SRC

#+RESULTS:
: hello there

#+BEGIN_SRC emacs-lisp :results silent
(defun mystery (&rest numbers)
  (loop for n from 0 to (apply 'lcm numbers)
        do (printf "%3d <--> %s\n" n
                   (loop for m in numbers collect (mod n m)))))
#+END_SRC
#+BEGIN_SRC elisp :results output
  (mystery 3 5)
#+END_SRC

#+RESULTS:
#+begin_example
  0 <--> (0 0)
  1 <--> (1 1)
  2 <--> (2 2)
  3 <--> (0 3)
  4 <--> (1 4)
  5 <--> (2 0)
  6 <--> (0 1)
  7 <--> (1 2)
  8 <--> (2 3)
  9 <--> (0 4)
 10 <--> (1 0)
 11 <--> (2 1)
 12 <--> (0 2)
 13 <--> (1 3)
 14 <--> (2 4)
 15 <--> (0 0)
#+end_example
** DONE JQA
   CLOSED: [2019-02-21 Thu 15:39]
#+begin_note
   What is a 3-digit positive simultaneous solution to the following system of
   linear congruences?

   x \equiv_7 3

   x \equiv_{11} 5

   x \equiv_{13} 4
#+end_note
#+begin_info
  654
#+end_info
#+BEGIN_SRC elisp :results silent
  (defun rns (n)
  (list (mod n 7) (mod n 11) (mod n 13)))
#+END_SRC
#+BEGIN_SRC elisp
  (defun from-rns (rns-triple)
(car (rassoc rns-triple rns-alist)))
#+END_SRC

#+RESULTS:
: from-rns

#+END_SRC
#+BEGIN_SRC elisp
  (setq rns-alist
  (loop for x from 0 to 1001
  for y = (rns x)
  collect (append (list x) y)))
#+END_SRC
#+BEGIN_SRC elisp :results raw
  (from-rns '(0 8 12))
#+END_SRC

#+RESULTS:
987
212
794
654

#+BEGIN_SRC elisp :results silent
  (defun to-rns (rns-num)
  (cdr (assoc rns-num rns-alist)))
#+END_SRC
#+BEGIN_SRC elisp
  (to-rns 555)
#+END_SRC

#+RESULTS:
| 2 | 5 | 9 |

#+END_SRC
** DONE JPZ
   CLOSED: [2019-02-21 Thu 16:12]
#+begin_note
  If p and q are coprime positive integers, then does a bijection necessarily
  exist between $\mathbb{Z}_{pq}$ and $\mathbb{Z}_{p} \times \mathbb{Z}_{q}$?

  Explain what the following code does, and how:
#+BEGIN_SRC elisp
  (let* ((p 3)
         (q 5)
         (z-pq (number-sequence 0 (* p q))))
      (mapcar* 'list z-pq
               (mapcar (lambda (n) (mod n p)) z-pq)
               (mapcar (lambda (n) (mod n q)) z-pq)))
#+END_SRC

  Imagine the above code were wrapped in a function definition with p and q
  passed as parameters instead of bound in the =let=, then compare this function
  to the =mystery= function. Which function would be more in the functional
  programming style?
#+end_note
#+begin_info
  This function does the same exact thing as the first exercise, but it uses mapping 
  instead of looping.  This is a better example of a functional program.
#+end_info
#+BEGIN_SRC elisp
  (let* ((p 3)
       (q 5)
       (z-pq (number-sequence 0 (* p q))))
    (mapcar* 'list z-pq
             (mapcar (lambda (n) (mod n p)) z-pq)
             (mapcar (lambda (n) (mod n q)) z-pq)))
#+END_SRC

#+RESULTS:
|  0 | 0 | 0 |
|  1 | 1 | 1 |
|  2 | 2 | 2 |
|  3 | 0 | 3 |
|  4 | 1 | 4 |
|  5 | 2 | 0 |
|  6 | 0 | 1 |
|  7 | 1 | 2 |
|  8 | 2 | 3 |
|  9 | 0 | 4 |
| 10 | 1 | 0 |
| 11 | 2 | 1 |
| 12 | 0 | 2 |
| 13 | 1 | 3 |
| 14 | 2 | 4 |
| 15 | 0 | 0 |

** DONE XFO
   CLOSED: [2019-02-21 Thu 16:20]
#+begin_note
  The Chinese Remainder Theorem makes possible the use of a /residue number
  system/ to do computer arithmetic with \ldquo{}large\rdquo integers, where largeness is
  relative. Large in practice means numbers with hundreds or thousands of
  digits. For this problem, large means no greater than 1000. Normally,
  arithmetic with numbers in this range would be trivial, but the normal
  arithmetic operations of addition, subtraction, and multiplication are to be
  viewed as quite expensive. You must find ways to avoid using them.
  Exponentially more expensive are the division and modulus operations --- avoid
  these especially!

  Use the code below as a guide and a starting point, finish implementing the
  =to-rns=, =from-rns=, =add2= and =mul2= functions, and then in separate code
  blocks, write test code that can correctly add and multiply one-, two-, and
  three-digit nonnegative integers, converting to rns, doing the rns operations,
  then converting back from rns.

  /Avoid at all costs/ the use of =+=, =-=, =*=, =/=, =%=, or =mod=!

  You will benefit greatly if you write helper functions and use good functional
  programming style throughout.

#+BEGIN_SRC elisp
  (defun to-rns (n)
    "Convert a normal integer between 0 and 1000 to its rns modulo
    1001 representation."
    )

  (defun from-rns (rns)
    "Convert from an rns modulo 1001 integer back to its normal
    representation."
    )

  (defun add2 (rns1 rns2)
    "Add two rns modulo 1001 integers to produce their rns sum."
    )

  (defun mul2 (rns1 rns2)
    "Multiply two rns modulo 1001 integers to produce their rns
    product."
    )
#+END_SRC

  The rest of the code is good as is. Note the mention in the documentation of
  the $\mathbb{Z}_7$, $\mathbb{Z}_{11}$, and $\mathbb{Z}_{13}$ residue sets. Recall
  that a $\mathbb{Z}_n$ residue set is just the possible remainders when modding
  by n, i.e., [0 1 2 3 \dots n-1].

#+BEGIN_SRC elisp
  (defun a7 (i j)
    "Add two nonnegative integers in the Z_7 residue set to produce
     a sum in that set. Error check to ensure the inputs are valid,
     and use table lookup instead of normal addition/mod."
    (unless (and (integerp i) (integerp j) (<= 0 i) (<= 0 j) (< i 7) (< j 7))
      (error "bad parameters %s and/or %s" i j))
    (aref (aref [[0 1 2 3 4 5 6]
                 [1 2 3 4 5 6 0]
                 [2 3 4 5 6 0 1]
                 [3 4 5 6 0 1 2]
                 [4 5 6 0 1 2 3]
                 [5 6 0 1 2 3 4]
                 [6 0 1 2 3 4 5]] i) j))

  (defun a11 (i j)
    "Add two nonnegative integers in the Z_11 residue set to produce
     a sum in that set. Error check to ensure the inputs are valid,
     and use table lookup instead of normal addition/mod."
    (unless (and (integerp i) (integerp j) (<= 0 i) (<= 0 j) (< i 11) (< j 11))
      (error "bad parameters %s and/or %s" i j))
    (aref (aref [[ 0  1  2  3  4  5  6  7  8  9 10]
                 [ 1  2  3  4  5  6  7  8  9 10  0]
                 [ 2  3  4  5  6  7  8  9 10  0  1]
                 [ 3  4  5  6  7  8  9 10  0  1  2]
                 [ 4  5  6  7  8  9 10  0  1  2  3]
                 [ 5  6  7  8  9 10  0  1  2  3  4]
                 [ 6  7  8  9 10  0  1  2  3  4  5]
                 [ 7  8  9 10  0  1  2  3  4  5  6]
                 [ 8  9 10  0  1  2  3  4  5  6  7]
                 [ 9 10  0  1  2  3  4  5  6  7  8]
                 [10  0  1  2  3  4  5  6  7  8  9]] i) j))

  (defun a13 (i j)
    "Add two nonnegative integers in the Z_13 residue set to produce
     a sum in that set. Error check to ensure the inputs are valid,
     and use table lookup instead of normal addition/mod."
    (unless (and (integerp i) (integerp j) (<= 0 i) (<= 0 j) (< i 13) (< j 13))
      (error "bad parameters %s and/or %s" i j))
    (aref (aref [[ 0  1  2  3  4  5  6  7  8  9 10 11 12]
                 [ 1  2  3  4  5  6  7  8  9 10 11 12  0]
                 [ 2  3  4  5  6  7  8  9 10 11 12  0  1]
                 [ 3  4  5  6  7  8  9 10 11 12  0  1  2]
                 [ 4  5  6  7  8  9 10 11 12  0  1  2  3]
                 [ 5  6  7  8  9 10 11 12  0  1  2  3  4]
                 [ 6  7  8  9 10 11 12  0  1  2  3  4  5]
                 [ 7  8  9 10 11 12  0  1  2  3  4  5  6]
                 [ 8  9 10 11 12  0  1  2  3  4  5  6  7]
                 [ 9 10 11 12  0  1  2  3  4  5  6  7  8]
                 [10 11 12  0  1  2  3  4  5  6  7  8  9]
                 [11 12  0  1  2  3  4  5  6  7  8  9 10]
                 [12  0  1  2  3  4  5  6  7  8  9 10 11]] i) j))

  (defun m7 (i j)
    "Multiply two nonnegative integers in the Z_7 residue set to produce
     a product in that set. Error check to ensure the inputs are valid,
     and use table lookup instead of normal multiplication/mod."
    (unless (and (integerp i) (integerp j) (<= 0 i) (<= 0 j) (< i 7) (< j 7))
      (error "bad parameters %s and/or %s" i j))
    (aref (aref [[0  0  0  0  0  0  0]
                 [0  1  2  3  4  5  6]
                 [0  2  4  6  1  3  5]
                 [0  3  6  2  5  1  4]
                 [0  4  1  5  2  6  3]
                 [0  5  3  1  6  4  2]
                 [0  6  5  4  3  2  1]] i) j))

  (defun m11 (i j)
    "Multiply two nonnegative integers in the Z_11 residue set to produce
     a product in that set. Error check to ensure the inputs are valid,
     and use table lookup instead of normal multiplication/mod."
    (unless (and (integerp i) (integerp j) (<= 0 i) (<= 0 j) (< i 11) (< j 11))
      (error "bad parameters %s and/or %s" i j))
    (aref (aref [[0  0  0  0  0  0  0  0  0  0  0]
                 [0  1  2  3  4  5  6  7  8  9 10]
                 [0  2  4  6  8 10  1  3  5  7  9]
                 [0  3  6  9  1  4  7 10  2  5  8]
                 [0  4  8  1  5  9  2  6 10  3  7]
                 [0  5 10  4  9  3  8  2  7  1  6]
                 [0  6  1  7  2  8  3  9  4 10  5]
                 [0  7  3 10  6  2  9  5  1  8  4]
                 [0  8  5  2 10  7  4  1  9  6  3]
                 [0  9  7  5  3  1 10  8  6  4  2]
                 [0 10  9  8  7  6  5  4  3  2  1]] i) j))

  (defun m13 (i j)
    "Multiply two nonnegative integers in the Z_13 residue set to produce
     a product in that set. Error check to ensure the inputs are valid,
     and use table lookup instead of normal multiplication/mod."
    (unless (and (integerp i) (integerp j) (<= 0 i) (<= 0 j) (< i 13) (< j 13))
      (error "bad parameters %s and/or %s" i j))
    (aref (aref [[0  0  0  0  0  0  0  0  0  0  0  0  0]
                 [0  1  2  3  4  5  6  7  8  9 10 11 12]
                 [0  2  4  6  8 10 12  1  3  5  7  9 11]
                 [0  3  6  9 12  2  5  8 11  1  4  7 10]
                 [0  4  8 12  3  7 11  2  6 10  1  5  9]
                 [0  5 10  2  7 12  4  9  1  6 11  3  8]
                 [0  6 12  5 11  4 10  3  9  2  8  1  7]
                 [0  7  1  8  2  9  3 10  4 11  5 12  6]
                 [0  8  3 11  6  1  9  4 12  7  2 10  5]
                 [0  9  5  1 10  6  2 11  7  3 12  8  4]
                 [0 10  7  4  1 11  8  5  2 12  9  6  3]
                 [0 11  9  7  5  3  1 12 10  8  6  4  2]
                 [0 12 11 10  9  8  7  6  5  4  3  2  1]] i) j))
#+END_SRC

#+RESULTS:
: m13

:HINT:
  - Hint :: For =to-rns= and =from-rns=, =assoc= and =rassoc= are recommended.
            Thus the creation of an association list (alist) is a prerequisite
            for using these functions. The challenge is to create this alist
            without using mod (or %) or loops.
:END:
#+end_note
#+begin_info
  Your answer goes here.
#+end_info
Functions to use:
apply
vconcat
mapcar*
vector

(mapcar 'documentation (mapcar 'intern (mapcar 'car funcs)))

apply 'vconcat mapcar* 'vector 
#+BEGIN_SRC elisp :results silent
  (defun shuffle (&rest sequences)
  (apply 'vconcat (apply 'mapcar* 'vector sequences)))
#+END_SRC
#+BEGIN_SRC elisp :results raw
  (shuffle [A B C] [x y z] '(1 2))
#+END_SRC

#+RESULTS:
[A x 1 B y 2]
[A x 1 B y 2 C z 3]
[A x B y C z]
[[A B C] [x y z]]

  (shuffle [A B C] [1 2 3)
#+END_SRC

#+BEGIN_SRC elisp :results silent
  (defun rns (n)
  (list (mod n 7) (mod n 11) (mod n 13)))
#+END_SRC
#+BEGIN_SRC elisp
  (defun from-rns (rns-triple)
(car (rassoc rns-triple rns-alist)))
#+END_SRC

#+END_SRC
#+BEGIN_SRC elisp
  (setq rns-alist
  (loop for x from 0 to 1001
  for y = (rns x)
  collect (append (list x) y)))
#+END_SRC
#+BEGIN_SRC elisp :results raw
  (from-rns '(0 8 12))
#+END_SRC

#+BEGIN_SRC elisp :results silent
  (defun to-rns (rns-num)
  (cdr (assoc rns-num rns-alist)))
#+END_SRC
#+BEGIN_SRC elisp
  (to-rns 555)
#+END_SRC
For this part, I consulted my roomate Brian!
#+BEGIN_SRC emacs-lisp :results silent
  (defun add2 (i j)
  (list (a7 (nth 0 i) (nth 0 j)) (a11 (nth 1 i) (nth 1 j)) (a13 (nth 2 i) (nth 2 j))))
    

  (defun mul2 (i j)
  (list (a7 (nth 0 i) (nth 0 j)) (a11 (nth 1 i) (nth 1 j)) (a13 (nth 2 i) (nth 2 j))))
#+END_SRC
#+BEGIN_SRC elisp :results list
  (add2 '(1 2 3) '(4 5 6))
#+END_SRC

#+RESULTS:
- 5
- 7
- 9

** DONE GYN
   CLOSED: [2019-02-28 Thu 15:31]
#+begin_note
  Help Abu and Ila out. This version of =mod-expt= gets a /little/ better
  mileage than their simplistic one. It keeps the numbers smaller by reducing
  each partial exponentiation by modding it once every iteration instead of once,
  period. What fact or facts of modular arithmetic justify this?

#+BEGIN_SRC elisp :results silent
  (defun a-better-mod-expt (base power modulus)
    (loop with result = 1
          for n from 1 to power
          do (setq result (mod (* result base) modulus))
          finally return result))
#+END_SRC
:HINT:
  - Hint :: Reread the interchange between Til, Abu and Ila in PQS.
:END:
#+end_note
#+begin_info
  So this function works by using the modular arithmetic rule that when finding a modulus,
  you can employ the property taht works as follows: Say you want to find 94 mod 5.  You can
  split that up into as many seperate problems as you'd like in order to get that answer.  For
  this example, I'll split it in three.  33 % 5 = 3, so if we take (33%5 + 33%5 + 28%5) % 5, we get
  the answer of 9 % 5 which is equal to 4.  This is what the above loop does, but at each step of
  the exponent!  This saves a significant amount of processing power!
#+end_info
#+BEGIN_SRC elisp
  (a-better-mod-expt 2 3 5)
#+END_SRC

#+RESULTS:
: 2

  Problem, to be precise.
** XGG
#+begin_note
  Experiment with RSA using the following code. You will need a better modular
  exponentiation function than =mod-expt= or perhaps even =a-better-mod-expt=.
  Implement the =pow-mod= function to be this better version. Note the
  difference between /encoding/ and /encryption/, and between /decryption/ and
  /decoding/.

  How \ldquo{}big\rdquo a message can you successfully round-trip?

#+BEGIN_SRC elisp :results silent
  (defun rsa-encrypt (message n e &optional encoder)
    (let* ((message-encoded (funcall (or encoder 'identity) message))
           (encrypted (pow-mod message-encoded e n)))
      encrypted))

  (defun rsa-decrypt (encrypted n d &optional decoder)
    (let* ((decrypted (pow-mod encrypted d n))
           (message-decoded (funcall (or decoder 'identity) decrypted)))
      message-decoded))

  (defun round-trip (message n e d &optional encoder decoder)
    (equal message
           (rsa-decrypt (rsa-encrypt message n e encoder)
                        n d decoder)))
#+END_SRC

  You will need working =from-base-27= and =to-base-27= functions, as well as a
  working knowledge of /symbol property lists/ to play with /this/ test code:

#+BEGIN_SRC elisp
  (defun test-rsa (message-with-spaces)
    (let* ((message (mapconcat 'identity
                               (split-string message-with-spaces " ") "@"))
            (n (get 'rsa-players :n))
            (e (get 'rsa-players :e))
            (d (get 'rsa-players :d))
            (encrypted (rsa-encrypt message n e 'from-base-27))
            (decrypted (rsa-decrypt encrypted n d 'to-base-27))
            (decrypted-message-with-spaces
             (mapconcat 'identity (split-string decrypted "@") " "))
            (success (string= message-with-spaces
                              decrypted-message-with-spaces)))
       (princ (format (concat "\"%s\"\nwas encoded and encrypted as\n%s\n"
                              "then decrypted and decoded as\n\"%s\"\n")
                      message-with-spaces
                      encrypted
                      decrypted-message-with-spaces))
       (princ (if success "" "un"))
       (princ "successfully.\n")
       success))
#+END_SRC
:HINT:
  - Hint :: This will be discussed in class.
:END:
#+end_note
#+begin_info
  Your answer goes here.
#+end_info

#+BEGIN_SRC elisp :results silent
(defun abr (n b)
  (let ((d (/ n b))
        (m (mod n b)))
    (if (zerop d)
        (list m)
      (append (abr d b) (list m)))))

  (defun to-base-27 (base-10-num)
    (mapconcat (lambda (n) (char-to-string (+ ?@ n))) (abr base-10-num 27) ""))
  (defun reconstruct-number-from-abr (list-of-coeff base)
   (if (null list-of-coeff)
      0
      (+ (car list-of-coeff)
         (* base (reconstruct-number-from-abr (cdr list-of-coeff) base)))))
  (defun from-base-27 (base-27-string)
    (reconstruct-number-from-abr (reverse (mapcar (lambda (n) (- n ?@)) base-27-string)) 27))
 
  (defun pow-mod (base power modulus)
   (

#+END_SRC


#+BEGIN_SRC elisp
  (from-base-27 "SUPERHOT")
#+END_SRC

#+RESULTS:
: 207115141394

#+BEGIN_SRC elisp :results show
  (to-base-27 207115141394) 
#+END_SRC

#+RESULTS:
: SUPERHOT


#+BEGIN_SRC elisp :results silent
  (defun rsa-encrypt (message n e &optional encoder)
    (let* ((message-encoded (funcall (or encoder 'identity) message))
           (encrypted (pow-mod message-encoded e n)))
      encrypted))

  (defun rsa-decrypt (encrypted n d &optional decoder)
    (let* ((decrypted (pow-mod encrypted d n))
           (message-decoded (funcall (or decoder 'identity) decrypted)))
      message-decoded))

  (defun round-trip (message n e d &optional encoder decoder)
    (equal message
           (rsa-decrypt (rsa-encrypt message n e encoder)
                        n d decoder)))
#+END_SRC

  You will need working =from-base-27= and =to-base-27= functions, as well as a
  working knowledge of /symbol property lists/ to play with /this/ test code:

#+BEGIN_SRC elisp :results silent
(setf (get 'rsa-players :p) 11)
(setf (get 'rsa-players :q) 17)
(setf (get 'rsa-players :n) (* (get 'rsa-players :p) (get 'rsa-players :q)))
(setf (get 'rsa-players :t) (* (- (get 'rsa-players :p) 1) (- (get 'rsa-players :q) 1)))
(setf (get 'rsa-players :e) '13)
(setf (get 'rsa-players :d) '37)


  (defun test-rsa (message-with-spaces)
    (let* ((message (mapconcat 'identity
                               (split-string message-with-spaces " ") "@"))
            (n (get 'rsa-players :n))
            (e (get 'rsa-players :e))
            (d (get 'rsa-players :d))
            (encrypted (rsa-encrypt message n e 'from-base-27))
            (decrypted (rsa-decrypt encrypted n d 'to-base-27))
            (decrypted-message-with-spaces
             (mapconcat 'identity (split-string decrypted "@") " "))
            (success (string= message-with-spaces
                              decrypted-message-with-spaces)))
       (princ (format (concat "\"%s\"\nwas encoded and encrypted as\n%s\n"
                              "then decrypted and decoded as\n\"%s\"\n")
                      message-with-spaces
                      encrypted
                      decrypted-message-with-spaces))
       (princ (if success "" "un"))
       (princ "successfully.\n")
       success))
#+END_SRC
#+BEGIN_SRC elisp :results output
  (test-rsa "Is")
#+END_SRC

#+RESULTS:
: "Is"
: was encoded and encrypted as
: 105
: then decrypted and decoded as
: "CZ"
: unsuccessfully.

